{
  "domains":
  {
    "Governance"                     : { "practices": ["Strategy & Metrics"  , "Policy & Compliance"   , "Education & Guidance"                                       ]},
    "Construction"                   : { "practices": ["Threat Assessment"   , "Security Requirements" , "Secure Architecture"                                        ]},
    "Verification"                   : { "practices": ["Design Review"       , "Implementation Review" , "Security Testing"                                           ]},
    "Opererations"                   : { "practices": ["Issue Management"    , "Environment Hardening" , "Operational Enablement"                                     ]}
  },
  "practices":
  {
    "Strategy & Metrics"             : { "key": "SM"   , "activities": [ "SM.1.A"  , "SM.1.B"  , "SM.1.C"  , "SM.2.A"  , "SM.2.B"  , "SM.2.C"  , "SM.3.A" , "SM.3.B"  ]},
    "Policy & Compliance"            : { "key": "PC"   , "activities": [ "PC.1.A"  , "PC.1.B"  , "PC.2.A"  , "PC.2.B"  , "PC.3.A"  , "PC.3.B"                         ]},
    "Education & Guidance"           : { "key": "EG"   , "activities": [ "EG.1.A"  , "EG.1.B"  , "EG.2.A"  , "EG.2.B"  , "EG.3.A"  , "EG.3.B"                         ]},

    "Threat Assessment"              : { "key": "TA"   , "activities": [ "TA.1.A"  , "TA.1.B"  , "TA.2.A"  , "TA.2.B"  , "TA.2.C"  , "TA.3.A"  , "TA.3.B"             ]},
    "Security Requirements"          : { "key": "SR"   , "activities": [ "SR.1.A"  , "SR.1.B"  , "SR.2.A"  , "SR.2.B"  , "SR.3.A"  , "SR.3.B"                         ]},
    "Secure Architecture"            : { "key": "SA"   , "activities": [ "SA.1.A"  , "SA.1.B"  , "SA.2.A"  , "SA.2.B"  , "SA.3.A"  , "SA.3.B"                         ]},

    "Design Review"                  : { "key": "DR"   , "activities": [ "DR.1.A"  , "DR.1.B"  , "DR.2.A"  , "DR.2.B"  , "DR.3.A"  , "DR.3.B"                         ]},
    "Implementation Review"          : { "key": "IR"   , "activities": [ "IR.1.A"  , "IR.1.B"  , "IR.2.A"  , "IR.2.B"  , "IR.3.A"  , "IR.3.B"                         ]},
    "Security Testing"               : { "key": "ST"   , "activities": [ "ST.1.A"  , "ST.1.B"  , "ST.1.C"  , "ST.2.A"  , "ST.2.B"  , "ST.3.A"  , "ST.3.B"             ]},

    "Issue Management"               : { "key": "IM"   , "activities": [ "IM.1.A"  , "IM.1.B"  , "IM.1.C"  , "IM.2.A"  , "IM.2.B"  , "IM.3.A"  , "IM.3.B"             ]},
    "Environment Hardening"          : { "key": "EH"   , "activities": [ "EH.1.A"  , "EH.1.B"  , "EH.2.A"  , "EH.2.B"  , "EH.3.A"  , "EH.3.B"                         ]},
    "Operational Enablement"         : { "key": "OE"   , "activities": [ "OE.1.A"  , "OE.1.B"  , "OE.2.A"  , "OE.2.B"  , "OE.3.A"  , "OE.3.B"                         ]}
  },
  "activities":
  {
    "SM.1.A"   :{ "level" :"1", "name" : "Is there a software security assurance program in place?"                                                                    },
    "SM.1.B"   :{ "level" :"1", "name" : "Are development staff aware of future plans for the assurance program?"                                                      },
    "SM.1.C"   :{ "level" :"1", "name" : "Do the business stakeholders understand your organization’s risk profile?"                                                   },
    "SM.2.A"   :{ "level" :"2", "name" : "Are many of your applications and resources categorized by risk?"                                                            },
    "SM.2.B"   :{ "level" :"2", "name" : "Are risk ratings used to tailor the required assurance activities?"                                                          },
    "SM.2.C"   :{ "level" :"2", "name" : "Does the organization know about what’s required based on risk ratings?"                                                     },
    "SM.3.A"   :{ "level" :"3", "name" : "Is per-project data for the cost of assurance activities collected?"                                                         },
    "SM.3.B"   :{ "level" :"3", "name" : "Does your organization regularly compare your security spend with that of other organizations?"                              },

    "PC.1.A"   :{ "level" :"1", "name" : "Do project stakeholders know their project’s compliance status?"                                                             },
    "PC.1.B"   :{ "level" :"1", "name" : "Are compliance requirements specifically considered by project teams?"                                                       },
    "PC.2.A"   :{ "level" :"2", "name" : "Does the organization utilize a set of policies and standards to control software development?"                              },
    "PC.2.B"   :{ "level" :"2", "name" : "Are project teams able to request an audit for compliance with policies and standards?"                                      },
    "PC.3.A"   :{ "level" :"3", "name" : "Are projects periodically audited to ensure a baseline of compliance with policies and standards?"                           },
    "PC.3.B"   :{ "level" :"3", "name" : "Does the organization systematically use audits to collect and control compliance evidence?"                                 },

    "EG.1.A"   :{ "level" :"1", "name" : "Have developers been given high-level security awareness training?"                                                          },
    "EG.1.B"   :{ "level" :"1", "name" : "Does each project team understand where to find secure development best-practices and guidance?"                             },
    "EG.2.A"   :{ "level" :"2", "name" : "Are those involved in the development process given role-specific security training and guidance?"                           },
    "EG.2.B"   :{ "level" :"2", "name" : "Are stakeholders able to pull in security coaches for use on projects?"                                                      },
    "EG.3.A"   :{ "level" :"3", "name" : "Is security-related guidance centrally controlled and consistently distributed throughout the organization?"                 },
    "EG.3.B"   :{ "level" :"3", "name" : "Are developers tested to ensure a baseline skill-set for secure development practices?"                                      },

    "TA.1.A"   :{ "level" :"1", "name" : "Do projects in your organization consider and document likely threats?"                                                      },
    "TA.1.B"   :{ "level" :"1", "name" : "Does your organization understand and document the types of attackers it faces?"                                             },
    "TA.2.A"   :{ "level" :"2", "name" : "Do project teams regularly analyze functional requirements for likely abuses?"                                               },
    "TA.2.B"   :{ "level" :"2", "name" : "Do project teams use a method of rating threats for relative comparison?"                                                    },
    "TA.2.C"   :{ "level" :"2", "name" : "Are stakeholders aware of relevant threats and ratings?"                                                                     },
    "TA.3.A"   :{ "level" :"3", "name" : "Do project teams specifically consider risk from external software?"                                                         },
    "TA.3.B"   :{ "level" :"3", "name" : "Are the majority of the protection mechanisms and controls captured and mapped back to threats?"                             },

    "SR.1.A"   :{ "level" :"1", "name" : "Do project teams specify security requirements during development?"                                                          },
    "SR.1.B"   :{ "level" :"1", "name" : "Do project teams pull requirements from best practices and compliance guidance?"                                             },
    "SR.2.A"   :{ "level" :"2", "name" : "Do stakeholders review access control matrices for relevant projects?"                                                       },
    "SR.2.B"   :{ "level" :"2", "name" : "Do project teams specify requirements based on feedback from other security activities?"                                     },
    "SR.3.A"   :{ "level" :"3", "name" : "Do stakeholders review vendor agreements for security requirements?"                                                         },
    "SR.3.B"   :{ "level" :"3", "name" : "Are audits performed against the security requirements specified by project teams?"                                          },

    "SA.1.A"   :{ "level" :"1", "name" : "Are project teams provided with a list of recommended third-party components?"                                               },
    "SA.1.B"   :{ "level" :"1", "name" : "Are project teams aware of secure design principles and do they apply them consistently?"                                    },
    "SA.2.A"   :{ "level" :"2", "name" : "Do you advertise shared security services with guidance for project teams?"                                                  },
    "SA.2.B"   :{ "level" :"2", "name" : "Are project teams provided with prescriptive design patterns based on their application architecture?"                       },
    "SA.3.A"   :{ "level" :"3", "name" : "Do project teams build software from centrally-controlled platforms and frameworks?"                                         },
    "SA.3.B"   :{ "level" :"3", "name" : "Are project teams audited for the use of secure architecture components?"                                                    },

    "DR.1.A"   :{ "level" :"1", "name" : "Do project teams document the attack perimeter of software designs?"                                                         },
    "DR.1.B"   :{ "level" :"1", "name" : "Do project teams check software designs against known security risks?"                                                       },
    "DR.2.A"   :{ "level" :"2", "name" : "Do project teams specifically analyze design elements for security mechanisms?"                                              },
    "DR.2.B"   :{ "level" :"2", "name" : "Are project stakeholders aware of how to obtain a formal secure design review?"                                              },
    "DR.3.A"   :{ "level" :"3", "name" : "Does the secure design review process incorporate detailed data-level analysis?"                                             },
    "DR.3.B"   :{ "level" :"3", "name" : "Does a minimum security baseline exist for secure design review results?"                                                    },

    "IR.1.A"   :{ "level" :"1", "name" : "Do project teams have review checklists based on common security related problems?"                                          },
    "IR.1.B"   :{ "level" :"1", "name" : "Do project teams review selected high-risk code?"                                                                            },
    "IR.2.A"   :{ "level" :"2", "name" : "Can project teams access automated code analysis tools to find security problems?"                                           },
    "IR.2.B"   :{ "level" :"2", "name" : "Do stakeholders consistently review results from code reviews?"                                                              },
    "IR.3.A"   :{ "level" :"3", "name" : "Do project teams utilize automation to check code against application-specific coding standards?"                            },
    "IR.3.B"   :{ "level" :"3", "name" : "Does a minimum security baseline exist for code review results?"                                                             },

    "ST.1.A"   :{ "level" :"1", "name" : "Do projects specify security testing based on defined security requirements?"                                                },
    "ST.1.B"   :{ "level" :"1", "name" : "Is penetration testing performed on high risk projects prior to release?"                                                    },
    "ST.1.C"   :{ "level" :"1", "name" : "Are stakeholders aware of the security test status prior to release?"                                                        },
    "ST.2.A"   :{ "level" :"2", "name" : "Do projects use automation to evaluate security test cases?"                                                                 },
    "ST.2.B"   :{ "level" :"2", "name" : "Do projects follow a consistent process to evaluate and report on security tests to stakeholders?"                           },
    "ST.3.A"   :{ "level" :"3", "name" : "Are security test cases comprehensively generated for application-specific logic?"                                           },
    "ST.3.B"   :{ "level" :"3", "name" : "Does a minimum security baseline exist for security testing?"                                                                },

    "IM.1.A"   :{ "level" :"1", "name" : "Do projects have a point of contact for security issues or incidents?"                                                       },
    "IM.1.B"   :{ "level" :"1", "name" : "Does your organization have an assigned security response team?"                                                             },
    "IM.1.C"   :{ "level" :"1", "name" : "Are project teams aware of their security point(s) of contact and response team(s)?"                                         },
    "IM.2.A"   :{ "level" :"2", "name" : "Does the organization utilize a consistent process for incident reporting and handling?"                                     },
    "IM.2.B"   :{ "level" :"2", "name" : "Are project stakeholders aware of relevant security disclosures related to their software projects?"                         },
    "IM.3.A"   :{ "level" :"3", "name" : "Are incidents inspected for root causes to generate further recommendations?"                                                },
    "IM.3.B"   :{ "level" :"3", "name" : "Do projects consistently collect and report data and metrics related to incidents?"                                          },

    "EH.1.A"   :{ "level" :"1", "name" : "Do projects document operational environment security requirements?"                                                         },
    "EH.1.B"   :{ "level" :"1", "name" : "Do projects check for security updates to third-party software components?"                                                  },
    "EH.2.A"   :{ "level" :"2", "name" : "Is a consistent process used to apply upgrades and patches to critical dependencies?"                                        },
    "EH.2.B"   :{ "level" :"2", "name" : "Do projects leverage automation to check application and environment health?"                                                },
    "EH.3.A"   :{ "level" :"3", "name" : "Are stakeholders aware of options for additional tools to protect software while running in operations?"                     },
    "EH.3.B"   :{ "level" :"3", "name" : "Does a minimum security baseline exist for environment health (versioning, patching, etc)?"                                  },


    "OE.1.A"   :{ "level" :"1", "name" : "Are security notes delivered with each software release?"                                                                    },
    "OE.1.B"   :{ "level" :"1", "name" : "Are security-related alerts and error conditions documented on a per-project basis?"                                         },
    "OE.2.A"   :{ "level" :"2", "name" : "Do projects utilize a change management process that’s well understood?"                                                     },
    "OE.2.B"   :{ "level" :"2", "name" : "Do project teams deliver an operational security guide with each product release?"                                           },
    "OE.3.A"   :{ "level" :"3", "name" : "Are project releases audited for appropriate operational security information?"                                              },
    "OE.3.B"   :{ "level" :"3", "name" : "Is code signing routinely performed on software components using a consistent process?"                                      }
  }
}





































